In [15]:
import pandas as pd
from sqlalchemy import create_engine

In [45]:
movie_file = "movies_metadata.csv"
movie_data_df = pd.read_csv(movie_file)
movie_data_df.head()


movie_data_df2= movie_data_df.drop(['adult', 'belongs_to_collection', 'genres', 'homepage','imdb_id','original_language','overview','popularity',
                                   'poster_path','release_date','runtime','spoken_languages','status','tagline','original_title',
                                   'video','vote_count','production_companies','production_countries'],axis=1)

movie_data_df2['id'] = pd.to_numeric(movie_data_df2['id'], downcast='integer', errors='coerce')
movie_data_df2.set_index('id')

movie_data_df2.head()

     budget       id      revenue                        title  vote_average
0  30000000    862.0  373554033.0                    Toy Story           7.7
1  65000000   8844.0  262797249.0                      Jumanji           6.9
2         0  15602.0          0.0             Grumpier Old Men           6.5
3  16000000  31357.0   81452156.0            Waiting to Exhale           6.1
4         0  11862.0   76578911.0  Father of the Bride Part II           5.7

In [30]:
rating_file = "ratings_small.csv"
rating_data_df = pd.read_csv(rating_file)
rating_data_df.head()


rating_data_df2= rating_data_df.drop(['userId','timestamp'],axis=1)
rating_data_df2

        movieId  rating
0            31     2.5
1          1029     3.0
2          1061     3.0
3          1129     2.0
4          1172     4.0
...         ...     ...
99999      6268     2.5
100000     6269     4.0
100001     6365     4.0
100002     6385     2.5
100003     6565     3.5

[100004 rows x 2 columns]

In [31]:
#
link_file = "links_small.csv"
link_data_df = pd.read_csv(link_file)
link_data_df.head()

link_data_df2= link_data_df.drop(['imdbId'],axis=1)

link_data_df2

      movieId    tmdbId
0           1     862.0
1           2    8844.0
2           3   15602.0
3           4   31357.0
4           5   11862.0
...       ...       ...
9120   162672  402672.0
9121   163056  315011.0
9122   163949  391698.0
9123   164977  137608.0
9124   164979  410803.0

[9125 rows x 2 columns]

In [46]:
link_rating_df = pd.merge(rating_data_df2, link_data_df2, on='movieId', how='outer')
link_rating_df

        movieId  rating    tmdbId
0            31     2.5    9909.0
1            31     3.0    9909.0
2            31     4.0    9909.0
3            31     4.0    9909.0
4            31     3.0    9909.0
...         ...     ...       ...
100058   161336     NaN  373348.0
100059   161582     NaN  338766.0
100060   163056     NaN  315011.0
100061   164977     NaN  137608.0
100062   164979     NaN  410803.0

[100063 rows x 3 columns]

In [47]:
link_rating_df.columns = ['movieId', 'rating', 'id']
link_rating_df

        movieId  rating        id
0            31     2.5    9909.0
1            31     3.0    9909.0
2            31     4.0    9909.0
3            31     4.0    9909.0
4            31     3.0    9909.0
...         ...     ...       ...
100058   161336     NaN  373348.0
100059   161582     NaN  338766.0
100060   163056     NaN  315011.0
100061   164977     NaN  137608.0
100062   164979     NaN  410803.0

[100063 rows x 3 columns]

In [48]:
link_rating_df['id'] = pd.to_numeric(link_rating_df['id'], downcast='integer', errors='coerce')

In [49]:
link_rating_df.reset_index(drop=True, inplace=True)

In [50]:
link_rating_df2 = pd.merge(link_rating_df, movie_data_df2, on='id', how='outer')
link_rating_df2

,movieId,rating,id,budget,revenue,title,vote_average
0,31.0,2.5,9909.0,0,180000000.0,Dangerous Minds,6.4
1,31.0,3.0,9909.0,0,180000000.0,Dangerous Minds,6.4
2,31.0,4.0,9909.0,0,180000000.0,Dangerous Minds,6.4
3,31.0,4.0,9909.0,0,180000000.0,Dangerous Minds,6.4
4,31.0,3.0,9909.0,0,180000000.0,Dangerous Minds,6.4
...,...,...,...,...,...,...,...
136604,NaN,NaN,439050.0,0,0.0,Subdue,4.0
136605,NaN,NaN,111109.0,0,0.0,Century of Birthing,9.0
136606,NaN,NaN,67758.0,0,0.0,Betrayal,3.8
136607,NaN,NaN,227506.0,0,0.0,Satan Triumphant,0.0
136608,NaN,NaN,461257.0,0,0.0,Queerama,0.0

In [51]:
#drop all rows with missing information
link_rating_df2 = link_rating_df2.dropna(how='any')
link_rating_df2

,movieId,rating,id,budget,revenue,title,vote_average
0,31.0,2.5,9909.0,0,180000000.0,Dangerous Minds,6.4
1,31.0,3.0,9909.0,0,180000000.0,Dangerous Minds,6.4
2,31.0,4.0,9909.0,0,180000000.0,Dangerous Minds,6.4
3,31.0,4.0,9909.0,0,180000000.0,Dangerous Minds,6.4
4,31.0,3.0,9909.0,0,180000000.0,Dangerous Minds,6.4
...,...,...,...,...,...,...,...
100181,64997.0,2.5,34812.0,1000000,0.0,H.G. Wells' War of the Worlds,4.4
100182,72380.0,3.5,22825.0,30000000,33333531.0,The Box,5.4
100183,129.0,3.0,110972.0,0,0.0,Pie in the Sky,7.0
100184,4736.0,1.0,26602.0,34000000,19693891.0,Summer Catch,4.8
100185,6425.0,1.0,36807.0,0,0.0,The Sixth Man,5.0